TheNetwork/app/views/users/show.html.erb

SELECT "credits".* FROM "credits" WHERE "credits"."user_id" = ?  [["user_id", 1]]
---
<p>My assets</p>
<%@user.credits.each do |credit|%>