TheNetwork/app/views/games/show.html.erb

SELECT "game_ratings".* FROM "game_ratings" WHERE "game_ratings"."game_id" = ?  [["game_id", 5]]
---
              <% contador = 0 %>
                <% @game.game_ratings.each do |rating| %>

SELECT "components".* FROM "components" INNER JOIN "component_in_games" ON "components"."id" = "component_in_games"."component_id" WHERE "component_in_games"."game_id" = ?  [["game_id", 5]]
---
        <hr>
        <% @game.components.each do |component| %>

SELECT "component_ratings".* FROM "component_ratings" WHERE "component_ratings"."component_id" = ?  [["component_id", 1]]
---
                <% contador = 0 %>
                <% component.component_ratings.each do |rating| %>