app/views/games/engine_games.html.erb

                      <% contador=0 %>
                      <% Tag.all.each do |tag| %>
---
SELECT "game_tags".* FROM "game_tags" WHERE "game_tags"."game_id" = ?  [["game_id", 1]]
SELECT "tags".* FROM "tags"

                          <h4>License: <%=game.license.name%></h4></p>
                          <% game.game_tags.each do |t| %>
---
SELECT "games".* FROM "games" WHERE "games"."engine_id" = ?  [["engine_id", 1]]