TheNetwork/app/controllers/components_controller.rb

  def finish
    otro = Component.find(params[:id])
    otro.finish = !otro.finish
    otro.save
---
SELECT  "components".* FROM "components" WHERE "components"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "components" SET "finish" = ?, "updated_at" = ? WHERE "components"."id" = ?  [["finish", "t"], ["updated_at", "2015-07-05 16:55:30.020024"], ["id", 4]]

  def index
    @components = Component.all
---
SELECT "components".* FROM "components"

    def set_component
      @component = Component.find(params[:id])
---
SELECT  "components".* FROM "components" WHERE "components"."id" = ? LIMIT 1  [["id", 2]]