TheNetwork/app/controllers/engines_controller.rb

SELECT "engines".* FROM "engines"
---
  def index
    @engines = Engine.all

INSERT INTO "engines" ("name", "description", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["image", nil], ["created_at", "2015-07-05 17:22:09.184415"], ["updated_at", "2015-07-05 17:22:09.184415"]]
---
  def create
    @engine = Engine.new(engine_params)

    @engine.image = params[:image]

    respond_to do |format|
      if @engine.save

SELECT  "engines".* FROM "engines" WHERE "engines"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_engine
      @engine = Engine.find(params[:id])