TheNetwork/app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."engine_id" = ?  [["engine_id", 1]]
---
  def engine_games
    @games = Game.where(:engine_id => params[:id])