TheNetwork/app/controllers/resources_controller.rb

  def create
    @resource = Resource.new(resource_params)

    respond_to do |format|
      if @resource.save
---
INSERT INTO "resources" ("name", "component_id", "video", "image", "download", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["component_id", 0], ["video", ""], ["image", nil], ["download", nil], ["created_at", "2015-07-08 02:47:33.109240"], ["updated_at", "2015-07-08 02:47:33.109240"]]