TheNetwork/app/views/engines/index.html.erb

SELECT "tags".* FROM "tags"
---
                      <% contador=0 %>
                      <% Tag.all.each do |tag| %>

SELECT "engine_tags".* FROM "engine_tags" WHERE "engine_tags"."engine_id" = ?  [["engine_id", 1]]
SELECT "engines".* FROM "engines"
---
                          <p><%= engine.description %><a href="#"> <%= link_to 'Show', engine %></a></p>
                          <% engine.engine_tags.each do |t| %>