TheNetwork/app/views/engines/show.html.erb

SELECT "engine_ratings".* FROM "engine_ratings" WHERE "engine_ratings"."engine_id" = ?  [["engine_id", 1]]
---
              <% contador = 0 %>
                <% @engine.engine_ratings.each do |rating| %>

SELECT "components".* FROM "components" WHERE "components"."engine_id" = ?  [["engine_id", 1]]
---
        <hr>
        <% @engine.components.each do |component| %>

SELECT "component_ratings".* FROM "component_ratings" WHERE "component_ratings"."component_id" = ?  [["component_id", 1]]
---
                <% contador = 0 %>
                <% component.component_ratings.each do |rating| %>