app/controllers/assets_controller.rb

  def index
    @assets = Asset.all
---
SELECT "assets".* FROM "assets"

    def set_asset
      @asset = Asset.find(params[:id])
---
SELECT  "assets".* FROM "assets" WHERE "assets"."id" = ? LIMIT 1  [["id", 1]]