app/controllers/credits_controller.rb

SELECT "credits".* FROM "credits"
---
  def index
    @credits = Credit.all