TheNetwork/app/views/components/show.html.erb


<% @component.resources.each do |resource| %>
---
SELECT "resources".* FROM "resources" WHERE "resources"."component_id" = ?  [["component_id", 2]]

              <% contador = 0 %>
                <% @component.component_ratings.each do |rating| %>
---
SELECT "component_ratings".* FROM "component_ratings" WHERE "component_ratings"."component_id" = ?  [["component_id", 2]]